import streamlit as st
import pandas as pd
import numpy as np

restaurants_data = {
    
    "类型": ["中餐", "中餐", "快餐", "自助餐", "西餐"],
    "评分": [4.2, 4.5, 4.0, 4.7, 4.3],
    "人均消费(元)": [15, 20, 25, 35, 50],
    "latitude": [22.853838, 22.965046, 22.812200, 22.809105, 22.839699],
    "longitude": [108.222177, 108.353921, 108.266629, 108.378664, 108.245804]
}

df= pd.DataFrame(restaurants_data)

index = pd.Series(["星艺会尝不忘", "高峰柠檬鸭", "复记老友粉", "好友缘", "西冷牛排店"], name = "餐厅")
df.index = index
col_1 = ['latitude', 'longitude']




st.header('地图')
st.map(df[col_1])

st.header('餐厅评分')
st.bar_chart(df['评分'])

st.header('不同类型餐厅价格')
st.line_chart(df['人均消费(元)'])

place = {
    '星艺会尝不忘': [120,125,251, 252, 151, 152, 152, 125, 123, 121,142,125],
    "高峰柠檬鸭": [111,125,121, 132, 151, 152, 152, 125, 123, 121,152,125],
    "复记老友粉": [117,125,231, 212, 151, 121, 112, 125, 123, 121,142,128],
    "好友缘": [122,125,251, 252, 151, 152, 152, 125, 123, 121,131,125],
    "西冷牛排店": [139,125,251, 252, 151, 125, 142, 125, 123, 121,142,129],
    
}

st.header('各餐厅全年价格走势')
df2 = pd.DataFrame(place)
index = pd.Series([1,2,3,4,5,6,7,8,9,10,11,12], name = '月份')
df2.index = index
st.line_chart(df2)
